// Задача 41: Пользователь вводит с клавиатуры M чисел. 
//Посчитайте, сколько чисел больше 0 ввёл пользователь.

// Console.WriteLine("Введите числа через пробел"); //Просим пользователя ввести числа
// string? line = Console.ReadLine() ?? "0";

// int[] num = line.Split(" ").Select(int.Parse).ToArray(); //Переводим строку в массив
// int sum = 0; //переменная для накопления

// for (int i = 0; i < num.Length; i++) //считаем количество числе больше 0
// {
//     if (num[i] > 0)
//     {
//         sum++;
//     }
// }
// Console.WriteLine("Количество введеных чисел больше 0: " + sum);


